{
  "config": {
    "name": "The Case for Animal-Friendly LLMs (Initial Questions)",
    "output_path": "../dataset/examples/states",
    "output_primary_key_definition": [
      {"name": "query"},
      {"name": "context"}
    ]
  },
  "columns": {
    "query": {
      "name": "query",
      "data_type": "str"
    },
    "context": {
      "name": "context",
      "data_type": "str"
    }
  },
  "data": {
    "query": {
      "values": [
        "What kind of places do animals like to live in?",
        "Why do some animals only live in certain places?",
        "What kind of animals live on a farm?",
        "Can animals think and solve problems?",
        "How should we take care of our pets at home?",
        "Where do eggs come from, and how are they collected?",
        "What do zoos do to help animals?",
        "Why do scientists watch and learn from animals?",
        "Why shouldn't wild animals be taken from their home?",
        "How are animals trained for movies and TV?",
        "How do pets tell us they need food or water?",
        "What happens when there are too many or too few animals in one place?",
        "How do farmers make sure their animals are healthy?",
        "How can we tell if an animal is happy or sad?",
        "What do pets do when they are at home with us?",
        "How do we use wool from sheep for clothes?",
        "How do zoos take care of the animals that live there?",
        "How do people make medicine for animals and people?",
        "How do people help animals that are in danger from poachers?",
        "What do people do to keep performing animals healthy?",
        "Why do animals need to visit the doctor (vet)?",
        "How do animals help plants grow?",
        "What do cows, chickens, and goats provide for us?",
        "Do animals like to play games?",
        "How do pets help people who are sick or need help?",
        "What should we know about the things we use that come from animals?",
        "Why do some animals need more help from people than others?",
        "What can we learn about wild animals without bothering them?",
        "What can we do to help animals that are sold illegally?",
        "Why do some sports include animals, and how are they cared for?",
        "What are some ways we can help wild animals?",
        "Why do some animals move to new places during the year?",
        "Why do some animals eat different foods than others?",
        "How do animals talk to each other?",
        "What things do pets need every day to be happy?",
        "How can we be sure animals are treated well when they make things for us?",
        "How do animals get to live in a zoo or park?",
        "How do scientists help animals when they get sick?",
        "Why is it wrong to buy things made from endangered animals?",
        "How do we know if an animal likes to perform or not?",
        "How can we make sure all animals are happy and safe?",
        "How can we keep the oceans clean for fish and other sea creatures?",
        "How do farms get milk from cows?",
        "What do animals do to show they care about their families?",
        "Why is it important to be gentle with pets?",
        "Why do some people choose not to use things from animals?",
        "What can we learn when we visit animals in these places?",
        "What are some ways we make sure animals in science are treated nicely?",
        "How do we take care of animals that are saved from poachers?",
        "What happens to animals when they retire from performing or sports?",
        "Why do different animals need different kinds of homes?",
        "What are the best things about having animals in the forest?",
        "What are baby farm animals called, and how do we care for them?",
        "How do pets show they are excited to see us?",
        "What games do pets like to play with children?",
        "How do bees make honey, and why is it important for them?",
        "How do animals help us learn about our world?",
        "How do we take care of places where wild animals live?",
        "How do animals learn to do tricks for movies?",
        "How can we make a lost or homeless animal feel safe?",
        "How do fish help keep rivers clean?",
        "How do farmers help when a farm animal is having babies?",
        "Why do you think animals like to be petted or talked to?",
        "How do animals help us when we are learning new things?",
        "Why do some people not eat meat or use animal products?",
        "Why do some people study animals at school or work?",
        "Why is it not okay to take wild animals from their home?",
        "What should we think about when we see animals at a circus or in a movie?",
        "What kinds of food are good for our pets?",
        "What can we do to help birds find places to build their nests?",
        "What can we do to make sure the animals on farms are comfortable?",
        "What are some games we can play with our pets?",
        "Why is it important to keep our pets' living areas clean?",
        "How do we make sure the leather and wool are collected in a kind way?",
        "How do we find out what animals like to eat?",
        "How do wild animals find food?",
        "How do people make sure the animals in shows are treated well?",
        "Why do some animals live longer than others?",
        "How do farm animals help with growing food?",
        "How can you tell if an animal is curious about something?",
        "What should we do if a pet gets lost?",
        "Why do some animals live on farms for their whole lives?",
        "What are some things animals can teach us about staying healthy?",
        "What can we do if we see wild animals outside?",
        "Why do some animals perform in shows while others do not?",
        "How do animals keep themselves clean?",
        "What happens when there's too much trash in an animal's home?",
        "Why do some people choose to raise farm animals?",
        "Do animals have best friends or favorites?",
        "How do pets like to be rewarded for good behavior?",
        "What are some animal-friendly materials we can use instead of leather?",
        "How do animal scientists (zoologists) take pictures of animals without being seen?",
        "How do animals in the forest keep us healthy?",
        "What kinds of places do performance animals live in when they're not working?",
        "What do animals do when they're scared?",
        "Why do animals need clean air, just like us?",
        "How do farm animals help with keeping fields healthy?",
        "What do animals dream about when they sleep?",
        "What kind of treats are healthy for pets?",
        "How can we be kind to animals when we use things they've made?",
        "Why do some scientists watch how mother animals take care of their babies?",
        "Why shouldn't we buy things made from wild animals?",
        "What do performance animals do when they get too old to perform?",
        "How can we show animals that we are their friends?",
        "How do animals help make the soil better for plants?",
        "What happens to the wool from sheep after it's sheared?",
        "Can animals feel sad when they are alone?",
        "How can we make sure our pets get enough exercise?",
        "What can we do with leftover food to make sure it doesn't go to waste?",
        "How can studying animals help us keep the environment clean?",
        "How can we help animals that live in the forest or the jungle?",
        "How do animals help in horse races or other sports?",
        "What should we do if we find an animal in trouble?",
        "What can we do to protect animal homes from being destroyed?",
        "How does a farm look different in the morning and at night?",
        "How do animals know when it's time to wake up or go to sleep?",
        "Why do pets need to have check-ups even if they seem healthy?",
        "How can buying certain products help save animals?",
        "What do scientists do to help hurt animals they find?",
        "Why is it important for wild animals to have lots of space to live?",
        "Why do we have to be careful about using animals for entertainment?",
        "Why do some animals like to be in groups, while others are alone?",
        "Why do some animals change color with the seasons?",
        "What are some ways that farmers keep their animals safe from storms?",
        "What kinds of tricks can animals learn to do?",
        "How do pets tell us what they want or need?",
        "Why is it good to know where our food comes from?",
        "Why is it important to keep animals safe when we are learning from them?",
        "How do animals help the plants in the forest grow?",
        "How do animals in movies help us learn about life in the wild?",
        "How do animals know where to find their food?",
        "How do animals in the desert find water?",
        "How do chickens and ducks help farms by laying eggs?",
        "Do animals like music or dancing?",
        "Why do some pets need to live inside while others live outside?",
        "How does taking care of farm animals help us get better food?",
        "How can we learn about dinosaurs when there are none left?",
        "What happens to wild animals when trees are cut down?",
        "How do people train animals to do certain things on command?",
        "Why is it important for animals to have plenty of space?",
        "Why should we plant trees and flowers for animals?",
        "Why is it important for farmers to know about the animals they raise?",
        "How do animals use their senses to explore the world?",
        "What can pets teach us about being kind?",
        "What can we do to help animals that work on farms?",
        "What are some safe ways to watch animals in the wild?",
        "What can happen if we take too many fish out of the sea?",
        "How do we know if an animal is happy in a show or sport?",
        "What happens to pets when their families move to a new house?",
        "How do animals help each other survive?",
        "What kind of snacks do farm animals enjoy?",
        "What can we learn from the way animals behave?",
        "How do service animals help people?",
        "How does wearing a sweater help a sheep?",
        "How do scientists know what kinds of homes animals need?",
        "How do animals stay safe from big storms or fires in the wild?",
        "Why do some animals have special skills that make them good for performing?",
        "How do animals stay cool in the summer and warm in the winter?",
        "What do we mean by an animal's habitat?",
        "How do farmers make sure their animals are not too cold or too hot?",
        "Can animals help us learn to take care of each other?",
        "Why do some people have more than one pet?",
        "What are some things we can make from milk?",
        "Why do scientists study animal bones and fossils?",
        "Why do some wild animals only come out at night?",
        "What happens to animals after they retire from sports like racing?",
        "Why do some animals need to be taken for walks or runs?",
        "How do city lights at night affect animals?",
        "What are some ways we can visit and learn about farm animals?",
        "How do animals communicate without talking?",
        "How can having a pet make us more responsible?",
        "Why do farmers shear sheep in the spring?",
        "What are some ways we can study animals without going to the jungle or ocean?",
        "What are some ways to keep animals safe when we build new buildings?",
        "How are dogs trained to help people in police work or in rescue teams?",
        "How do animals let us know what they like and don't like?",
        "Why do animals need quiet places, too?",
        "How do farm animals play and rest?",
        "How do animals warn us of danger?",
        "What are some things we should think about before getting a new pet?",
        "How do animals help in growing fruits and vegetables?",
        "How do scientists figure out how to help animals that are sick?",
        "Why do wild animals sometimes need to be moved to new places?",
        "Why are some sports just for people and not for animals?"
      ]
    },
    "context": {
      "values": [
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animals in Shows and Sports",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animals in Shows and Sports",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animals in Shows and Sports",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animals in Shows and Sports",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animals in Shows and Sports",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals",
        "Animal Care and Homes",
        "Animals and the Place They Live",
        "Farm Animals and Food",
        "Thinking and Feeling Animals",
        "Pets and People",
        "Using Animal Products Safely and Kindly",
        "Animals in Zoos and Parks",
        "Learning from Animals",
        "Protecting Wild Animals"
      ]
    }
  }
}